[{"name":"Abigail Leigh Abell","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2017","convictionCounty":"Grayson","home":"Leitchfield","bevinComments":"Abigail Abell made a foolish decision that resulted in an altercation not at all in line with her life or behavior either before that time or since; and with the granting of this full and unconditional pardon, Abigail will have a fresh start and I am confident that she will use it wisely in the years ahead.","charges":"Harassment charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0989-264230.pdf"},{"name":"Adinna Darlene Alcorn","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2012","convictionCounty":"Madison","home":"Berea","bevinComments":"Adinna Alcorn has made mistakes, broken the law and been convicted. She has since left that life behind and has become the wife and mother she was intending to be. She is a good example to others who have struggled with addiction and she has a burning desire to be successful in life. I am confident that she will be; and it is my privilege to grant her the full and unconditional pardon she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0992-264233.pdf"},{"name":"Alana Marie Morton","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2001","convictionCounty":"Fayette","home":"Lexington","bevinComments":"Alana Morton is a new woman. She has turned her life around and today she  is a good wife, mother, role model to others and upstanding citizen. She and her children should be very proud.","charges":"Robbery and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1254-264436.pdf"},{"name":"Albert Eugene Brison","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1998","convictionCounty":"Christian","home":"Hopkinsville","bevinComments":"Many years have passed since Albert Brison was convicted of burglary in 1997; and it is my privilege to grant Mr. Brison the full and unconditional pardon that he has requested for this 22 year old crime.","charges":"Receiving stolen property and burglary charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1000-264241.pdf"},{"name":"Aleisha Nicole Julian","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2014, 2009","convictionCounty":"Jefferson, Kenton","home":"Lousiville","bevinComments":"Aleisha Julian is an incredible woman.  She is an overcomer and an example to others for how to turn a broken life around. Although she has made mistakes and has been criminally prosecuted, she has paid her debt to society and turned her life into something beautiful.","charges":"Theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1121-264535.pdf"},{"name":"Alicia Murphy Quire","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2018, 2018","convictionCounty":"Shelby, Anderson","home":"Hazel Green","bevinComments":"Alicia Murphy Quire is working to tum her life around. Conditional upon the successful completion of all parole supervision obligations required between this date and 7/4/2022.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1310-264923.pdf"},{"name":"Allen Nelson Scott","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2009, 2005, 2009, 2009","convictionCounty":"Pendleton, Harrison, Campbell","home":"Falmouth","bevinComments":"(No explanation given)","charges":"Theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1285-264412.pdf"},{"name":"Amanda Dawn Hall","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2011, 2009","convictionCounty":"Martin","home":"Louisville","bevinComments":"Amanda Hall went through a dark period of addiction and resulting criminal activity. She has since turned her life around and is a true blessing to many in her community. She has paid her debt to society and continues to give back on multiple fronts.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1077-264944.pdf"},{"name":"Amanda Sue Grim","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2017, 2013, 2010","convictionCounty":"Lawrence","home":"Louisa","bevinComments":"Amanda Grim has chosen to leave her life of addiction and crime and chart a new path. She is using her talents wisely and serving her community as a productive citizen.","charges":"Drug and weapons charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1247-264429.pdf"},{"name":"Amanda Theresa Behling","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2018","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Amanda Behling has done a few things wrong and many things right in her young adult life. In recent years, she has turned her life around and serves as a role model for others to emulate. She is a great mother, a great fried, a great Kentuckian and a great American. ... (H)er honorable service  to our nation is worthy of our collective  gratitude  and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Driving under the influence charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1064-264932.pdf"},{"name":"Amy Lynn Bailey","orderDate":"12/3/2019","type":"Pardon","convictionDate":"2018","convictionCounty":"Fayette","home":"Paris","bevinComments":"Amy Bailey had a lapse in judgment on a single night that resulted in her behaving in a way that she never had before and never has since. She is a good woman, a good mother, a good friend to many and a good citizen; and she has paid her debt to society and it is my privilege to grant her the full and unconditional pardon that she as requested.","charges":"Wanton endangerment and criminal trespass","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1043-264350.pdf"},{"name":"Andre' Jones, Jr.","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2013","convictionCounty":"Jefferson","home":"New Albany, IN","bevinComments":"Andre' Jones, Jr. has paid his debt  to society  for  the crimes  he committed and has turned his life around. It is my belief that he will continue to be an example to others by using his own life experiences for good in his community.","charges":"Robbery charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1079-264946.pdf"},{"name":"Andrew David Keller","orderDate":"11/22/2019","type":"Pardon","convictionDate":"2011","convictionCounty":"Daviess","home":"Owensboro","bevinComments":"Andrew Keller made a foolish decision as a young man and was appropriately held to account for his actions. That said, he has fully paid his debt to society and has proven himself to be an exemplary citizen; and it is my privilege to grant Andrew the full and unconditional pardon that he has requested. I am confident that he will do great things with his fully restored life, and that he will be a great father and husband in the years ahead.","charges":"Trafficking in marijuana charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0935-264111.pdf"},{"name":"Angela Ann Banta","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2000","convictionCounty":"Fayette","home":"Lexington","bevinComments":"Angela Banta made a series of unwise decisions two decades ago. Since that time, she has turned her life around and has become a model citizen.","charges":"Robbery and drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1355-264467.pdf"},{"name":"Angela Danielle Null","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2009","convictionCounty":"Lawrence","home":"Louisa","bevinComments":"Angela Null made a series of unwise and criminal decisions for many years. She has turned her life around and is marching successfully forward in a new direction. She is a blessing to her community and an example for others to follow.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1140-264553.pdf"},{"name":"Angela Dawn Peters","orderDate":"11/27/2019","type":"Pardon","convictionDate":"2004","convictionCounty":"Henderson","home":"Henderson","bevinComments":"Angela Peters has done everything that we would ask of any returning citizen. Her life of service to others that is informed by her own history of mistakes and criminal behavior is truly exemplary; and she is one of her communitys finest citizens and it is my privilege to grant the full and unconditional pardon that she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0977-264176.pdf"},{"name":"Angela Houchin Reshonsky","orderDate":"12/9/2019","type":"Pardon & Commutation","convictionDate":"2017","convictionCounty":"Edmonson","home":"","bevinComments":"Angel Reshonsky has walked a troubled road in life starting as a child. She took the law into her own hands in self-defense. She was tried and convicted. I hereby commute her sentence to time served and pardon her for the charges associated with this sentence.","charges":"Manslaughter and tampering","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1331-264458.pdf"},{"name":"Angela Marie Elzy","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2000","convictionCounty":"Hardin","home":"Louisville","bevinComments":"Angela Elzy made some poor decisions 20 years ago and was duly tried and convicted for breaking the law. Since that time, she has turned her life around and has fully paid her debt to society; and it is my privilege to grant Angela the full and unconditional pardon that she has requested.","charges":"Wanton endangerment and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1007-264248.pdf"},{"name":"Angela Nicole Collins","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2008","convictionCounty":"Knott","home":"Cornettsville","bevinComments":"Angela Collins has turned her life around. She is a good mother, a good student and a good citizen.","charges":"Burglary and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1074-264941.pdf"},{"name":"Anthony Robert Cash","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2009, 2003, 2007, 2006, 2000, 2005, 2005, 2004","convictionCounty":"Grant, Bracken, Campbell, Harrison, Bourbon, Pendleton","home":"Louisville","bevinComments":"Anthony R. Cash is a man on a mission and is a powerful blessing to all those he meets. His life has been transformed by this faith in Christ and he has become a great asset to Kentucky as one of our finest citizens.","charges":"Drug, terroristic threatening, assault, resisting arrest, weapons and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1284-264411.pdf"},{"name":"Anthony William Dykes","orderDate":"11/22/2019","type":"Pardon","convictionDate":"2005, 2004, 2001","convictionCounty":"Wayne","home":"Monticello","bevinComments":"Anthony Dykes has turned his life around after a series of poor choices for which he was prosecuted approximately 15 years ago. He is a strong family man and is a valuable, hard-working member of his community. He is blessed by an amazing group of friends and supporters to whom he serves as an example of a life renewed; and it is my privilege to grant Anthony the full and unconditional pardon that he has requested.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0930-264106.pdf"},{"name":"Arnold Early Eversole","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2010, 2005, 2003","convictionCounty":"Kenton","home":"Taylor Mill","bevinComments":"(No explanation given)","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1359-264464.pdf"},{"name":"Austin Jerry Gray","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2016, 2015, 2013, 2013","convictionCounty":"Graves, Marshall","home":"Mayfield","bevinComments":"Austin Gray made a series of bad decisions, fueled by addiction and leading to criminal convictions. In recent years he has turned his life around. He is now a good husband, father, employee, tax-payer and good example to others in his community; and it is my privilege to grant him the full and unconditional pardon that he has requested. I am confident that he will continue to do great things in his life in the years ahead.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1012-264253.pdf"},{"name":"Blake Peterson Walker","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2003","convictionCounty":"Adair","home":"[Blank]","bevinComments":"It is not possible for me to capture my full thought process as I have weighed the decision of how to handle the commutation and pardon request from Blake Walker; and there is a fine and delicate balance between justice and mercy, between a sentence that serves a purpose for everyone and a sentence that does not serve a purpose for anyone; and Blake Walker is blessed by a loving and forgiving family and it is this alone that tips the delicate balance in the direction of his request; and Blake Walker committed a crime for which only God can provide true forgiveness. Even so, with the authority granted to be by the Kentucky Constitution, I hereby commute his sentence and pardon him so that he can proceed with his life,  unrestricted  in  his efforts to serve the world and the needs of others in a way that would best honor the lives and life work of his mother and father: Now, therefore, I, Matthew G. Bevin, Governor of the Commonwealth  of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby commute the sentence of Blake Peterson Walker to time served and simultaneously grant him a full and unconditional pardon and return to him all rights and privileges of a citizen of this Commonwealth.","charges":"Two counts of murder","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1263-264380.pdf"},{"name":"Bradley Aaron Roberts","orderDate":"12/6/2019","type":"Pardon","convictionDate":"","convictionCounty":"Daviess","home":"Louisville","bevinComments":"Bradley Roberts is a new man since his return to society and his return to sobriety. He has turned his life around in a clearly recognizable fashion and has become a model husband, employee and community citizen. ... (H)is heart for serving others who are recovering from addiction is exemplary and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Drug and resisting arrest charges in in Daviess County","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1145-264558.pdf"},{"name":"Bradley Stephen Boyington","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2014, 2014","convictionCounty":"Perry, Knox","home":"Chavies","bevinComments":"Bradley Boyington has turned his life around in recent years and has become a model citizen. He is an excellent husband, a hard worker, a skilled craftsman and an inspirational mentor to others; and it is my privilege to grant Brad the full and unconditional pardon that he has requested.","charges":"Assault and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0997-264238.pdf"},{"name":"Brandon Lee Hawkins","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2015","convictionCounty":"Christian","home":"Hopkinsville","bevinComments":"Brandon Hawkins has paid his debt to society for his lapse in judgment some years ago; and because there is no value to anyone for him to pay further for his misconduct, it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Two counts of rape, sodomy and official misconduct charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1014-264255.pdf"},{"name":"Brandon Louis Lee","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2003, 2008, 2003, 2004, 2009","convictionCounty":"Washington, Marion","home":"Lebanon","bevinComments":"Brandon Lee was on a wayward path for many years marked  by addiction  and criminal activity. He has turned his life around and is now a model husband, father, employer and community citizen.","charges":"Drug, theft, resisting arrest and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1311-264924.pdf"},{"name":"Breanna Nicole Grubb","orderDate":"11/27/2019","type":"Pardon","convictionDate":"2013, 2009","convictionCounty":"Greenup, Boyd","home":"Ashland","bevinComments":"Breanna Grubb has turned her life around and now serves as a mentor to others struggling with addiction. She should be proud of the responsible and valuable member of society she has become; and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0970-264169.pdf"},{"name":"Brenda Lee Sims","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2003","convictionCounty":"Caldwell","home":"Princeton","bevinComments":"Brenda Sims veered off course in life a couple of decades ago.  Since that time, she has worked to turn her life around.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1147-264560.pdf"},{"name":"Brett Dustin Whittaker","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2011, 2006","convictionCounty":"Lincoln. Madison","home":"[Blank]","bevinComments":"Brett Whittaker acted in a criminally negligent manner a decade ago and his actions resulted in the death of two innocent people. There is no possible sentence that can atone for what has been lost. The purpose of incarceration is to, as best society is able, provide both justice and rehabilitation. Both are desired and essential for the successful continuance of civil society. No duration of time can provide full payment for the taking of an innocent life; and what then about rehabilitation? Brett Whittaker has utilized the past nine years in prison to transform his life spiritually, emotionally and psychologically. In this regard, he embodies the best of what society would hope for prison to do for an inmate. He is a new man ready to return to his community; and will he, his children, his community or the family and friends of the victims be better off if Brett Whittaker remains in prison? Because no lives are made better, and some will undoubtedly be made worse, if Mr. Whittaker’s release date occurs when he is in his 40s rather than in his 30’s; and with his new lease on life Mr. Whittaker incurs a heavy responsibility to ensure that every single day is lived in a manner that serves others and honors the memories of the innocent lives lost because of his actions. I am confident that with God’s help, he will do so.","charges":"Two murder charges and an assault charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1223-264389.pdf"},{"name":"Brian Allen Carter","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2005","convictionCounty":"Fayette","home":"Chavies","bevinComments":"Brian Carter made a series of unwise decisions for which he was charged and convicted. He has since turned his life around and has become a productive and law-abiding citizen.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1279-264454.pdf"},{"name":"Brian Douglas Srygler Jr.","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2009, 2007, 2008, 2005","convictionCounty":"Hart, Larue, Barren, Hart","home":"Bonnieville","bevinComments":"Brian Srygler, Jr. has come a long way in life in recent years and has much to be proud of. He is a hardworking and loving son, husband and father. He serves as a great example of what is possible with faith and determination.","charges":"Drug chages","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1154-264567.pdf"},{"name":"Bryan Donald Lamm","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2012","convictionCounty":"Boyd","home":"Ashland","bevinComments":"Bryan Lamm is a good man, a good husband, a good father and  a good citizen. Years ago he made an unwise decision that resulted in criminal consequences. ... (H)e has paid his debt to society and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Assault charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1082-264949.pdf"},{"name":"Bryant Lee Copeland","orderDate":"12/4/2019","type":"Pardon","convictionDate":"1996","convictionCounty":"Nelson","home":"Bardstown","bevinComments":"Bryant Copeland made some unwise and criminal decisions more than 20 years ago. Since that time he has turned his life around.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1076-264943.pdf"},{"name":"Chad D. Patterson","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2007, 2001, 2001, 1999","convictionCounty":"Mercer, Fayette, Shelby","home":"Daville","bevinComments":"Chad Patterson made a series of unwise decisions as a young man. He has since turned his life around and is now a model citizen. His commitment to his family, his faith and his community is a shining example for others to follow.","charges":"Drug, assault and weapons charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1255-264437.pdf"},{"name":"Chance Fredrick-Sterling Staley","orderDate":"11/27/2019","type":"Pardon","convictionDate":"2012","convictionCounty":"Fayette","home":"Lexington","bevinComments":"Chance Staley is a man who has left his law breaking life of addiction behind him and is seizing the opportunity at multiple levels to become a model citizen; and he has proven himself to be an exemplary leader and it is my privilege to grant the full and unconditional pardon that he has requested.","charges":"Trafficking","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0978-264177.pdf"},{"name":"Chandra Dawn Blevins","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2013, 2014","convictionCounty":"Bell, Harlan","home":"Harlan","bevinComments":"After struggling with addiction and the law breaking life style it led to, Chandra Blevins has emerged as a new woman. Her devotion to her faith, her family and her community is highly commendable. I hope that she and her children are as proud of her as I am. She is a great role model to others who have followed a similar early path in life. I am confident that Chandra has a very bright and significant future ahead of her; and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Fraud, theft and identity theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0996-264237.pdf"},{"name":"Charles D. Phelps","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2013","convictionCounty":"London","home":"[blank]","bevinComments":"This conviction resulted from a process long in duration, long on accusation, long on drama and short on evidence. It was sloppy at best.","charges":"Possession of matter and tampering with a witness","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1328-264476.pdf"},{"name":"Charles Dewayne Crabtree","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1987","convictionCounty":"Fayette","home":"Vine Grove","bevinComments":"Charles Crabtree was convicted more than 30 years ago, has paid his debt to society and has lived a law-abiding and productive life since that time; and he is hereby granted the full and unconditional pardon that he has requested.","charges":"Sodomy","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1005-264246.pdf"},{"name":"Charles Leon Maupin III","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2010","convictionCounty":"Fayette","home":"Nicholasville","bevinComments":"Charles L. Maupin, III is a determined man who has successfully kept his life on an upward trajectory in recent years. He is a good father, good  employee, good student  and  good citizen.","charges":"Theft and harassment charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1125-264539.pdf"},{"name":"Chris Allen Spears","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2008, 2007","convictionCounty":"Jerfferson","home":"Louisville","bevinComments":"Spears made a series of unwise decisions as a young man that resulted in criminal consequences. He has turned his life around in a remarkable way and is now a model citizen. He is a great husband, father, employee and a positive example to others.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1268-264449.pdf"},{"name":"Christian Jutt Moffett","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2019","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Christian Moffett is a young man with extraordinary potential in life. Up to this point in time he has repeatedly squandered that potential. Nonetheless, he  has, in  recent months, made an effort to tum his life around. ... I hereby grant Mr. Moffett full and unconditional pardon that  he  has requested and encourage him to use this new lease on life to be a law-abiding, model citizen.","charges":"Drug, theft and firearm charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1091-264958.pdf"},{"name":"Christopher Arnold Jamison","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2012, 2012","convictionCounty":"Rowan, Montgomery","home":"Owingsville","bevinComments":"Christopher Jamison is a good man who has turned his life around and is a valuable citizen. His volunteer service is a blessing to many in his community.","charges":"Fraud charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1119-264533.pdf"},{"name":"Christopher IIX","orderDate":"12/4/2019","type":"Pardon","convictionDate":"1997, 1990","convictionCounty":"Jefferson, Kenton","home":"Louisville","bevinComments":"Christopher IIX is a man with a heart for community service. He  has turned his life around after a rocky start many years ago and he has paid his debt to society. In fact, he has paid that debt with dividends that continue to multiply and bless those with whom he interacts. ... (H)e is an upstanding citizen and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Theft and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1070-264937.pdf"},{"name":"Christopher Shaun Wood","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2008","convictionCounty":"Garrard","home":"Lexington","bevinComments":"With a conviction based on no evidence other than  testimony  from  the proven rapist and his friend in exchange for a lesser sentence, it is difficult for me to be confident that justice has been served in this tragic case.","charges":"Rape and sexual abuse charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1312-264925.pdf"},{"name":"Cindy Ann Aguilar","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2005","convictionCounty":"Jessamine ","home":"Bryantsville","bevinComments":"Cindy Aguilar has learned from the mistakes of her past and has chosen a new direction for her life. She has paid her debt to society and is a good mother, caregiver and citizen; and it is my privilege to grant her the full and unconditional pardon she has requested. I am confident that she will do great things with her life in the years to ahead.","charges":"Assault charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0991-264232.pdf"},{"name":"Corey Daniel Lee","orderDate":"12/4/2019","type":"Pardon","convictionDate":"1996","convictionCounty":"Graves","home":"Mayfield","bevinComments":"Corey Lee is a good man, a good father, a good employee and a good citizen.\nHe paid his debt to society long ago.","charges":"Wanton endangerment charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1085-264952.pdf"},{"name":"Crandell Lee Slone, Jr.","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1983","convictionCounty":"Shelby ","home":"Bostin, MI","bevinComments":"More than 25 years ago Crandell Slone made an unwise decision that resulted in criminal consequences. Since that time, he has turned his life in a positive new direction and has never looked back.","charges":"Burglary and receiving stolen property","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1149-264562.pdf"},{"name":"Crystal Michelle Barrow-Maggard","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2003","convictionCounty":"Grayson","home":"Owensboro","bevinComments":"Crystal Barrow-Maggard is a good woman, a good mother, a good employee and a good citizen. She has fully paid any debt that she ever owed to society. ... (I)it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1062-264930.pdf"},{"name":"Cynthia Lynn Mallory","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2013, 2012, 2001, 2000, 1999, 1998, 1996, 1994, 2010, 2008","convictionCounty":"Hopkins, Daviess","home":"Madisonville","bevinComments":"For 20 years, Cynthia Mallory fought a losing battle against addiction and criminal activity. In recent years, she has turned her life around and now uses her life experience to help others ... it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1253-264435.pdf"},{"name":"Daniel Hostetler","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2014","convictionCounty":"Hart ","home":"[Blank]","bevinComments":"Neither Daniel Hostetler, his community, society at large, nor the entire criminal justice system have been well served by the sloppy and unjust prosecution and defense of his case. I am a combination of sickened, saddened, and outraged at the multiple degrees of incompetence displayed by many individuals during their multiple efforts to incarcerate a simple man for a crime that zero evidence shows that he committed. There is however, much testimony and evidence to the contrary; and I am grateful that the Kentucky Constitution affords me the ability to make right the wrongs that have been done in this tragic case and it is my privilege to do so.","charges":"Manslaughter and tampering with evidence","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1224-264390.pdf"},{"name":"Daniel Scott Grubb","orderDate":"12/9/2019","type":"Pardon & Commutation","convictionDate":"2010","convictionCounty":"Knox","home":"","bevinComments":"Drugs, alcohol and a tragic accident resulted in the death of one friend perpetrated by another.  Daniel Grubb made a series of  bad decisions that forever altered  the lives of many people in a negative way. No greater degree of justice or rehabilitation will be gained by extending Daniel Grubb's time in prison. There will, however, be negative impacts of others, not the least of whom is Daniel's son Chase. With the expectation that Mr. Grubb will live his life as a model citizen in a way that will bring honor to his family and to the memory of his friend, Jeremy Johnson.","charges":"Murder and tampering with physical evidence","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1289-264404.pdf"},{"name":"Danny Eugene Hogue","orderDate":"12/4/2019","type":"9","convictionDate":"2009, 2006","convictionCounty":"Jessamine, Garrard","home":"Wilmore","bevinComments":"Danny Hogue has always maintained his innocence of the charges made against him. No evidence has ever been presented to dispute his claim of innocence. While the charges are reprehensible, they have never been proven to be true. In fact, there is much evidence supporting Mr. Hague's innocence. ... (B)ecause mere accusations without proof should not be  the  basis  of  convicting a person, if falls to me to remedy this miscarriage of justice and to hereby grant Mr. Hogue the full and unconditional pardon that he has requested.\r\n","charges":"Theft and sexual abuse charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1078-264945.pdf"},{"name":"Darrell Shawn Whitlock","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2006, 2003, 2001, 2000, 1989","convictionCounty":"Fayette","home":"Nicholasville","bevinComments":"Darrell Whitlock has turned his life around and has become a model citizen and a blessing to his family and community.","charges":"Theft, burglary and assault charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1348-264473.pdf"},{"name":"Darryl Miller","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1993, 1987","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Darryl Miller has paid his debt for past crimes and has become a productive member of society. His service to others is a blessing to his community.","charges":"Sexual misconduct, unlawful transaction with minor","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1131-264544.pdf"},{"name":"Darryl Thomas Gardner","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1993","convictionCounty":"Fleming","home":"Seymour, TN","bevinComments":"Darryl Gardner has turned his life around, served  our  nation  in  uniform  and fully paid his debt to society.","charges":"Arson charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1245-264427.pdf"},{"name":"David Kevin Burgess","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2000, 1993","convictionCounty":"Breckinridge","home":"Vine Grove","bevinComments":"David K. Burgess has paid his debt to society for crimes he committed decades ago; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Non-support and assault charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1001-264242.pdf"},{"name":"David Lee West","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2001, 1994","convictionCounty":"Woodford, Knox","home":"Versailles","bevinComments":"David West has paid his debt to society.","charges":"Theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1349-264472.pdf"},{"name":"David Louis Combess","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1988, 1988, 1987","convictionCounty":"Rowan, Elliott, Rowan","home":"Morehead","bevinComments":"David Combess made some poor decisions decades ago for which he was tried and convicted. Since that time, he has turned his life around and has been a good husband, father, hard worker and model citizen; and it is my privilege to grant Mr. Combess the full and unconditional pardon that he has requested.","charges":"Burglary and persistent felony offender charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1004-264245.pdf"},{"name":"David Patrick Mathys","orderDate":"12/4/2019","type":"Pardon","convictionDate":"1976","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"(M)ore than 40 years ago, David Mathys was a teenager and made some unwise decisions that resulted in his arrest and conviction. Since that time he, has lived a good, productive life as a husband, father, grandfather, employee and community citizen.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1090-264957.pdf"},{"name":"Davy Thornsbury","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2015","convictionCounty":"Knott","home":"Topmost","bevinComments":"Davy Thornsbury has turned his life around after his criminal activity in the past. He is a good husband and father and is blessed to have the support of  many  friends  and family.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1161-264574.pdf"},{"name":"Dayton Ross Jones","orderDate":"12/9/2019","type":"Pardon & Commutation","convictionDate":"2016","convictionCounty":"Christian","home":"[blank]","bevinComments":"(No explanation given)","charges":"Sodomy, wanton endangerment and distributing matter portraying sexual performance by minor","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1332-264459.pdf"},{"name":"Delmar Partin","orderDate":"12/9/2019","type":"Pardon & Commutation","convictionDate":"1994","convictionCounty":"Knox","home":"[Blank]","bevinComments":"I hereby commute the sentence of Delmar Partin from life to time served. Additionally, given the inability or unwillingness of the state to use existing DNA evidence to either affirm or disprove this conviction, I hereby pardon Mr. Partin for this crime and encourage the state to make every effort to bring final justice for the victim and her family.","charges":"Murder","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1313-264927.pdf"},{"name":"Demetrius Howard Scott","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2017","convictionCounty":"Boyd","home":"Pikeville","bevinComments":"Demetrius Scott is a new man.  He  has turned  his life around  after veering off track with addiction and its criminal consequences. His faith, his intellect and his personal drive to succeed will hold him and his children in good stead in the years ahead.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1146-264559.pdf"},{"name":"Dennis Vowels","orderDate":"12/9/2019","type":"Pardon ","convictionDate":"1978","convictionCounty":"Daviess","home":"","bevinComments":"Dennis Vowels paid his debt to society many years ago.","charges":"Burglary and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1287-264414.pdf"},{"name":"Dewey Ray Lewis","orderDate":"11/21/2019","type":"Pardon","convictionDate":"2003, 1993","convictionCounty":"Laurel, Perry","home":"London","bevinComments":"Dewey Lewis is a man who turned his life around after a troubled and criminal past. He has been an exemplary father, community citizen, volunteer and student. He serves as a role model for others on how to take personal responsibility for his life; and It is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Wanton endangerment and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0904-264033.pdf"},{"name":"Dolores Rose Hill McClurg","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2010, 2007, 2007","convictionCounty":"Grayson, Hardin, Grayson","home":"Leitchfield","bevinComments":"Dolores McClurg has  turned  her life around and has become  a role model for others to follow. Her heart for serving others is a blessing to those she meets.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1127-264541.pdf"},{"name":"Donald Gene Ellis","orderDate":"12/3/2019","type":"Pardon","convictionDate":"1985","convictionCounty":"Henry","home":"Pleasureville","bevinComments":"Donald Ellis made a bad decision nearly 35 years ago and has lived an exemplary, law-abiding life since that time. He has fully paid any debt that he owed to society; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Unauthorized use of a motor vehicle","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1045-264352.pdf"},{"name":"Donna Fay McNees","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2002","convictionCounty":"Franklin","home":"Frankfort","bevinComments":"Donna McNees has paid her debt to society and has turned her life in a positive direction. She is a good citizen and a blessing to her community.","charges":"2002 in Franklin County","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1129-264543.pdf"},{"name":"Donna Marie Wheeler","orderDate":"11/21/2019","type":"Pardon","convictionDate":"2011","convictionCounty":"Johnson","home":"Paintsville","bevinComments":"Ms. Wheeler is a survivor of domestic violence who was formerly incarcerated for killing her abuser. She was issued a commutation of sentence to time served in 2015. So that Ms. Wheeler can move forward in her life unfettered by her conviction, I am pleased to grant her the full and unconditional pardon that she has requested: NOW, THEREFORE, I, Matthew G. Bevin, Governor of the Commonwealth of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby unconditionally pardon Donna Marie Wheeler and return to her all rights and privileges of a citizen of this Commonwealth.","charges":"Manslaughter charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0916-264047.pdf"},{"name":"Donne Sue Hunter","orderDate":"11/27/2019","type":"Pardon","convictionDate":"2014","convictionCounty":"Madison","home":"Richmond","bevinComments":"Donna Hunter made a bad decision and has been duly punished as a result. She has otherwise lived a law-abiding life and is an asset to her community; and it is my privilege to grant Donna the full and unconditional pardon that she has requested.","charges":"Two promoting contraband charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0975-264174.pdf"},{"name":"Dustin Kyle Hawkins","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2006","convictionCounty":"Kenton","home":"New Albany, IN","bevinComments":"Dustin Hawkins is a new man. After a life that became mired in addiction and its criminal consequences led him off track, he has regained his sobriety, his freedom and his sense of purpose. He is a good example to others and has a heart for service to those who need someone to care about them; and it is my privilege to grant Dustin the full and unconditional pardon that he has requested.","charges":"Possession of a controlled substance","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1018-264259.pdf"},{"name":"Dustin L. Moore","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2005","convictionCounty":"Lawrence","home":"Louisa","bevinComments":"Dustin Moore has turned his life around and has become a valuable and productive member of his community ... (H)is heart for serving others is exemplary and it is my privilege to grant him  the full and unconditional pardon that he has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1135-264548.pdf"},{"name":"Earl Clinton Hurt","orderDate":"11/27/2019","type":"Pardon","convictionDate":"1999","convictionCounty":"Perry","home":"Hazard","bevinComments":"Earl Hurt has made many decision in his life. Years ago, they were often bad decision and they resulted in a criminal record. In recent years, he has made increasingly good decision and has turned his life around; and it is my privilege to grant Mr. Hurt the full and unconditional pardon that he has requested.","charges":"Theft charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0976-264175.pdf"},{"name":"Edison Lee Witt","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2009","convictionCounty":"Jackson","home":"McKee","bevinComments":"Edison Lee Witt made an unwise decision more than 10 years ago. He has since turned his life around and is an asset to his community.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1356-264466.pdf"},{"name":"Edward Andrew Stewart","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2010","convictionCounty":"Jackson, Madison","home":"McKee","bevinComments":"Edward \"Andy\" Stewart has turned away from a life of addiction and crime and has chosen a new and positive direction in life. He mother would be very proud of the man he has become.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1157-264570.pdf"},{"name":"Elizabeth Anina Sorrell","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2005","convictionCounty":"Menifee","home":"Frenchburg","bevinComments":"Elizabeth Sorrell is a winner and a great role model to others. Having turned her life around after years of addiction and criminal behavior, she is now an upstanding citizen who serves others.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1151-264564.pdf"},{"name":"Elizabeth Dana Stakelbeck","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2014","convictionCounty":"Jefferson ","home":"Louisville","bevinComments":"On the compelling testimony of Elizabeth Stakelbeck's friends and family, and her stated desire for a fresh start in life, I am granting her the pardon she has requested.","charges":"Solicitation of murder and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1269-264450.pdf"},{"name":"Eric Allen Gilbert","orderDate":"11/27/2019","type":"Pardon","convictionDate":"1990, 1989","convictionCounty":"Nelson, Spencer","home":"Bloomfield","bevinComments":"Eric Gilbert has turned his life around since he was convicted for his criminal activity nearly 30 years ago. He is an excellent husband, father, employee and community citizen; and it is my privilege to grant Eric the full and unconditional pardon that he has requested.","charges":"Trafficking charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0967-264166.pdf"},{"name":"Farhad Fred Etghayi","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1990","convictionCounty":"Jefferson","home":"Jackson, TN","bevinComments":"Farhad Etghayi was convicted for breaking the law 30 years ago. Since that time he has paid his debt to society and has been a model husband, father, employee, employer, tax-payer and community citizen; and it is my privilege to grant Mr. Etghayi the full and unconditional pardon that he has requested.","charges":"Arson","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1008-264249.pdf"},{"name":"Felicia Gail Miller","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2015, 2010, 2007","convictionCounty":"Perry","home":"Bonnyman","bevinComments":"Felicia Miller has emerged from the grip of addiction  as a new woman.  She is a good wife, a good mother, a good friend, a good employee and a good role model  for others. ... (S)he is now a productive citizen and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Fraud charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1132-264545.pdf"},{"name":"Franklin D. Bland, Jr.","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2012","convictionCounty":"Rockcastle","home":"Mr. Vernon","bevinComments":"Franklin D. Bland,Jr. is a new man. He has emerged from a life of addiction and turned his life around. He now serves as a role model, mentor and inspiration to others who are struggling.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1067-264934.pdf"},{"name":"Gabriel Dean Kidd","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2017","convictionCounty":"Jefferson","home":"[Blank]","bevinComments":"I have carefully read all the compelling letters of support from family, friends, employers and members of law enforcement, as well as the details surrounding this robbery for which Gabriel Kidd is incarcerated; and contingent upon Mr. Kidd agreeing in writing to abstain from alcohol and attend Alcoholics Anonymous classes no less frequently than monthly, starting in December 2019, I do hereby commute his sentence to time served and pardon him only for this felony conviction: NOW, THEREFORE, I, Matthew G. Bevin, Governor of the Commonwealth  of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby commute the sentence of Gabriel Dean Kidd to time served and simultaneously grant him a and conditional pardon and return to him all rights and privileges of a citizen of this Commonwealth.","charges":"Robbery","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1275-264384.pdf"},{"name":"Gary Gene Cooper III","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2008","convictionCounty":"Scott","home":"Nancy","bevinComments":"Gary G. Cooper, III has turned his life around and has paid his  debt  to society.","charges":"Reckless homicide","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1075-264942.pdf"},{"name":"Gary Hugh Lucas","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1996","convictionCounty":"Gallatin","home":"Falmouth","bevinComments":"Gary Lucas has been plagued by a propensity to steal throughout much of his adult life. He has served his family and community well, but as a former police officer he should understand that stealing is unacceptable under any circumstances. As a result of his clean record in recent years and his stated desire for a clean start. I am granting the pardon that he has request for his 1996 felony conviction. All other arrests and convictions will remain as a part of Gary Lucas' record.","charges":"Theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1266-264447.pdf"},{"name":"Gary Payton","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2006","convictionCounty":"Lincoln","home":"Stanton","bevinComments":"Gary Payton led a wayward and criminal life for many years. He has since turned his life around.","charges":"Wanton endangerment charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1347-264474.pdf"},{"name":"George Thomas Green","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2014, 2013, 2011, 2011","convictionCounty":"Johnson, Flyod, Johnson","home":"Inez","bevinComments":"(No explanation given)","charges":"Bail jumping, evading police, drug and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1246-264428.pdf"},{"name":"Glen Earl Hagood","orderDate":"11/27/2019","type":"Pardon","convictionDate":"2011, 2010","convictionCounty":"McCracken","home":"Clearwater, FL","bevinComments":"Glen Hagood is a man who has learned from his early mistakes in life and has turned his life around in recent years. With a new lease on life, Glen has the opportunity to be of greater service to others and to be an even stronger member of his community; and it is my privilege to grant Glen the full and unconditional pardon that he has requested.","charges":"Forgery, burglary and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0971-264170.pdf"},{"name":"Gordon Ray Carpenter","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2009","convictionCounty":"Breathitt","home":"Lexington","bevinComments":"Gordon Carpenter used poor judgment many years ago. He  has long since  paid any debt that may have been owed to society. He is a military veteran, a good husband, good father and good citizen.","charges":"Sexual misconduct charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1072-264939.pdf"},{"name":"Gregory Scott Sutton","orderDate":"12/6/2019","type":"Pardon","convictionDate":"","convictionCounty":"Hopkins, Christian","home":"Nortonville","bevinComments":"I hereby pardon Gregory Sutton for all past felony convictions that are not expungable by other means. I encourage him to follow the process necessary to remove all expungable charges from his record and use this fresh start to chart and maintain a new direction in life.","charges":"No charges listed in order","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1270-264451.pdf"},{"name":"Harry Eugene Pedigo","orderDate":"11/21/2019","type":"Pardon","convictionDate":"2011, 2007, 2001, 2005","convictionCounty":"Nelson, Hardin","home":"Owensboro","bevinComments":"After a turbulent start in life and a series of increasingly bad decisions, Harry Pedigo has turned his life around. His life story is an example to others of how to seize an opportunity for redemption. Harrys service to his community, his genuine remorse for his past criminal activities and his willingness to use his life experiences to help others is impressive; and it is my privilege to grant Harry Pedigo the full and unconditional pardon that he has requested.","charges":"Forgery, theft and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0917-264041.pdf"},{"name":"Harvey Edward McCraw","orderDate":"11/21/2019","type":"Pardon","convictionDate":"1998","convictionCounty":"Christian","home":"Hopkinsville","bevinComments":"Harvey McCraw has been an exemplary father, employer, taxpayer and community citizen since he was convicted of a single victimless crime more than 20 years ago; and he has paid all restitution and it is my privilege to grant Harvey the full and unconditional pardon that he has requested.","charges":"Wanton endangerment and criminal mischief charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0910-264039.pdf"},{"name":"Helen Kay Doss","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2001, 1988","convictionCounty":"Jefferson, Henry","home":"Lockport","bevinComments":"Helen Doss has paid her debt to society.","charges":"Harassment, reckless homicide","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1237-264420.pdf"},{"name":"Isiah Jasper Minter","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2010, 2009, 2010, 2009","convictionCounty":"Jefferson, Fayette","home":"Louisville","bevinComments":"Isiah Minter made some very poor decisions as a young man. He broke the law, was caught, tried and convicted. Since that time he has turned his life completely around. Isiah took a new sense of responsibility for his life, changed his environment and pursued his education and career. He serves as a model for other young men to follow; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Theft, burglary, resisting arrest charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1022-264263.pdf"},{"name":"Jacob William Hartman","orderDate":"11/27/2019","type":"Pardon","convictionDate":"2006","convictionCounty":"Owen","home":"Cecilia","bevinComments":"Jacob Hartman has become a model citizen since paying his debt to society many years ago. He is an exemplary husband, father, employee and an upstanding member of his church and community; and it is my privilege to grant Mr. Hartman the full and unconditional pardon that he has requested.","charges":"Trafficking charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0973-264172.pdf"},{"name":"Jacqueline Lacy Day","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2011","convictionCounty":"Harlan ","home":"Cumberland","bevinComments":"It is my privilege to grant her the full and unconditional pardon that she has requested. Her journey to recovery is an example to others and her service is a blessing to her family and her community.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1236-264419.pdf"},{"name":"Jacqueline N. Farris","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2002","convictionCounty":"Greenup","home":"Greenup","bevinComments":"Jacqueline Horn Farris made some poor decisions as a teenager and young woman nearly 20 years ago. She has fully paid any debt that she owed to society. Jacqueline has turned her life around and serves as a role model to others; and she is a great mother, family member, friend and neighbor and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1009-264250.pdf"},{"name":"James B. Terry","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1981","convictionCounty":"Jefferson","home":"Jeffersonville","bevinComments":"James Terry is an upstanding citizen who paid his debt to society many years ago.","charges":"Robbery","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1159-264572.pdf"},{"name":"James Brandon Harrison","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2010, 2008, 2006, 2005","convictionCounty":"Jackson, Madison, Logan, Fayette","home":"McKee","bevinComments":"James \"Brandon\" Harrison has done an outstanding job of turning his life\naround. His journey to recovery serves as a shining example for others to follow.","charges":"Drug and weapons charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1249-264431.pdf"},{"name":"James C. Bradley","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2010, 2007","convictionCounty":"Floyd","home":"Stanville","bevinComments":"James Bradley has chosen to turn his life around and has lived a law-abiding and hard-working life for the past decade. With the belief that he will continue to show others what a reformed life can look like; and it is my privilege to grant Jim the full and unconditional pardon that he has requested.","charges":"Fleeing or evading police and operating on a suspended/revoked license charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0999-264240.pdf"},{"name":"James Harold Utley","orderDate":"12/9/2019","type":"Pardon","convictionDate":"1976, 1974","convictionCounty":"Webster, Dixon","home":"Providence","bevinComments":"James Harold Utley paid his debt to society long ago.","charges":"Burglary charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1353-264469.pdf"},{"name":"James Larry Brown","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2014, 1997","convictionCounty":"Meade, Jefferson","home":"Guston","bevinComments":"James L. Brown was charged and convicted more than 20 years ago. He has paid his debt to society and has been a good husband, father, employee and community citizen.","charges":"Assault charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1068-264935.pdf"},{"name":"James Michael Robinson","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2000, 1997, 1997","convictionCounty":"Shelby","home":"Frankfort","bevinComments":"Jimmy Robinson has turned his life around after an early life of criminal decisions. He is a great husband, father, employee and citizen. He has paid his debt to society.","charges":"Wanton endangerment, fleeing police, persistent felony offender, theft and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1256-264438.pdf"},{"name":"James Robert Sons","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1990","convictionCounty":"Clark","home":"Georgetown","bevinComments":"James Sons made some unwise decisions thirty years ago. Since paying his debt to society, he has been a hardworking, model citizen. He is a valuable member of his community.","charges":"Trafficking","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1257-264439.pdf"},{"name":"James Robert Thacker","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2005, 1998","convictionCounty":"Whitley","home":"Rockholds","bevinComments":"James Thacker turned his life around 15 years ago and has been marching forward in a positive direction since that time. He has paid his debt to society and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1160-264573.pdf"},{"name":"James Thomas Stanley","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1983","convictionCounty":"Warren","home":"Franklin","bevinComments":"James Stanley is a good husband, father and public employee. Many decades ago he made a decision to break the law. He has fully paid his debt to society; and he is a model citizen and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Robbery charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1024-264265.pdf"},{"name":"Janine Marie Abdellaoui","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1995","convictionCounty":"Kenton","home":"Covington","bevinComments":"Janine Abdellaoui made a bad decision many years ago and has lived an exemplary, law-abiding life in the decades since. She is a highly motivated, hardworking member of society and, even better, a loving and dedicated mother to her children. I hope that they are as proud of her as I am for the life she has lived since her teenage lapse in judgment; and it is my privilege to grant her the full and unconditional pardon that she has requested. I am confident that she has a bright and significant future ahead of her.","charges":"Burglary charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0988-264229.pdf"},{"name":"Jason Brian Lyons","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2007, 2005","convictionCounty":"Pulaski, McCreary","home":"Winfield, TN","bevinComments":"Jason Lyons has turned his life around and is now an example for others to follow. He is a good father, husband, business owner and citizen.","charges":"Burglary charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1252-264434.pdf"},{"name":"Jayson Eric Martin","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1997","convictionCounty":"Fayette","home":"Melbourne, FL","bevinComments":"(M)ore than 20 years ago, Jayson Martin made an unwise decision that had criminal consequences. Since that time he has turned his life around and serves his family, his employer and his community with distinction.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1123-264537.pdf"},{"name":"Jeffrey Alan Collins","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1996, 1994, 1993","convictionCounty":"Allen","home":"Adolphus","bevinComments":"Jeffery Collins made a series of poor decisions a quarter of a century ago. He has paid his debt to society and has turned his life around; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Menacing, violation of emergency order and assault charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1003-264244.pdf"},{"name":"Jennifer Jeanette Adams","orderDate":"11/19/2019","type":"Pardon","convictionDate":"2010","convictionCounty":"Harlan","home":"Evarts","bevinComments":"Jennifer Adams is a woman who has taken the broken pieces of her life and turned them into something beautiful. She is an amazing example for others to follow and, as a person who is continuously serving others, she is a true blessing to those around her; and I am privileged to grant Jennifer the full and unconditional pardon that she has requested and deserves.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0870-263890.pdf"},{"name":"Jennifer Keller-Stone","orderDate":"12/11/2019","type":"Pardon & Commutation","convictionDate":"2018, 2013","convictionCounty":"Grayson","home":"[Blank]","bevinComments":"(No explanation given)","charges":"Assault charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1273-264382.pdf"},{"name":"Jerry David Lewis","orderDate":"11/22/2019","type":"Pardon","convictionDate":"2004","convictionCounty":"Whitley","home":"Evarts","bevinComments":"Jerry David Dave Lewis has become everything that one would hope a returning citizen would be. He is a hardworking, taxpaying, God-fearing, community helping, family man. His mother and father would be proud of the man that Dave is today. His life honors their memory well; and it is my privilege to grant Dave the full and unconditional pardon that he has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0929-264105.pdf"},{"name":"Jerry Don Staley","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2013","convictionCounty":"Cumberland","home":"Burkesville","bevinComments":"Jerry Don Staley is blessed to have the love and respect of his family and many people in his community. He has turned away from his old life of addiction and criminal behavior. He should be very proud of the man he has become.","charges":"Manufacturing meth, 2013 in Cumberland County","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1155-264568.pdf"},{"name":"Jerry Wayne Moses","orderDate":"11/21/2019","type":"Pardon","convictionDate":"1990","convictionCounty":"Harrison","home":"Sevierville, TN","bevinComments":"As a young man, nearly 30 years ago, Jerry Moses was convicted of breaking the law. Since that time, after paying his debt to society, he has done everything we would hope for a returning citizen to do. He is now an outstanding husband, father, community member, taxpayer, and he is a good example for others to follow; and it is my privilege to grant Jerry the full and unconditional pardon that he has requested.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0905-264034.pdf"},{"name":"Jessie Marie Lewis","orderDate":"12/4/2019","type":"Pardon","convictionDate":"1988","convictionCounty":"Daviess","home":"Erlanger","bevinComments":"Jessie Lewis has been a law-abiding and upstanding citizen for more than 30 years. She paid any debt that she owed to society long ago.","charges":"Receiving stolen property","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1087-264954.pdf"},{"name":"Jilletta Wright Turner","orderDate":"11/21/2019","type":"Pardon","convictionDate":"1998","convictionCounty":"Grayson","home":"Albany","bevinComments":"Ms. Turner is a survivor of domestic violence who was formerly incarcerated for killing her abuser. She was issued a commutation of sentence to time served in 2015. So that Ms. Turner can move forward in her life unfettered by her conviction, I am pleased to grant her the full and unconditional pardon that she has requested: NOW, THEREFORE, I, Matthew G. Bevin, Governor of the Commonwealth of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby unconditionally pardon Jilletta Wright Turner and return to her all rights and privileges of a citizen of this Commonwealth.","charges":"Murder and assault charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0915-264046.pdf"},{"name":"Jimmie Darrell Bryant","orderDate":"12/6/2019","type":"Pardon ","convictionDate":"None listed","convictionCounty":"Russell, Adair, Taylor","home":"Russell Springs","bevinComments":"I am granting Jimmie Bryant a partial pardon for all felony convictions that are not expungable by law. To truly clear up his record from all past convictions, Mr. Bryant will still need to follow the process defined by law to expunge the remaining charges.","charges":"No charges listed on order","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1264-264445.pdf"},{"name":"Johiem Bandy","orderDate":"12/9/2019","type":"Pardon & Commutation","convictionDate":"2017","convictionCounty":"Kenton","home":"","bevinComments":"Johiem Bandy made some unwise decisions as a young teenager. Since then, he has done all that has been asked of him and is turning his life around.","charges":"Robbery and assault charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1351-264461.pdf"},{"name":"John Adam Blackaby","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2006","convictionCounty":"Trimble","home":"Crestwood","bevinComments":"John Blackaby made a foolish and criminal decision many years ago. Since that time, he has turned his life around and has become a model husband, father, employee and community citizen. He is a good example for others to follow.","charges":"Arson charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1066-264933.pdf"},{"name":"John Lewis Decker","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1950","convictionCounty":"Ohio","home":"Beaver Dam","bevinComments":"John Decker lived his adult life as a good husband, a good father, a good deacon and a good Kentuckian; and for any violation of any Kentucky law that John may have even committed, it is my privilege to grant him the full and unconditional pardon.","charges":"Stealing copper wire","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1006-264247.pdf"},{"name":"John Merriman Riley","orderDate":"12/3/2019","type":"Pardon","convictionDate":"1972","convictionCounty":"Hopkins","home":"Taylorsville","bevinComments":"John Riley was with the wrong friend at the wrong time as a teenager more than 45 years ago. Since that time he has served his communities well in both the private sector and in the public sector. His dedication to being an upstanding citizen is exemplary; and it is my privilege to grant John the full and unconditional pardon that he has requested.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1049-264356.pdf"},{"name":"John Paul Roth, Jr.","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2017","convictionCounty":"Campbell","home":"[Blank]","bevinComments":"John Roth made a foolish decision a few years ago and broke the law. The punishment does not appear to fit the crime when all the facts are considered; and for this reason, I am commuting Mr. Roths sentence to time served and issuing him a full and unconditional pardon.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1225-264391.pdf"},{"name":"John Weddington Scott","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2006","convictionCounty":"Boone","home":"Lexington","bevinComments":"John W. Scott battled addiction and its criminal consequences  for  many years. He has since turned his life around and has devoted it to serving others. Drawing upon his personal experience as a military veteran, a recovering addict and a retuning citizen, he now provides support, counseling and encouragement to other struggling veterans. ... (I)t is my privilege to grant Mr. Scott the full and unconditional pardon that he has requested. I am confident that he will continue to use his new-found  purpose  to serve others  and to be the man he was created to be.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1093-264960.pdf"},{"name":"Johnetta Carr","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2008","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Johnetta Carr is a strong and highly motivated woman with a very bright future. I am confident  that she will contribute in powerful ways  to  society as a whole and to those in her community specifically. God clearly has His hand on her.","charges":"Manslaughter, robbery and tampering with evidence charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1283-264410.pdf"},{"name":"Johnny Burkhart","orderDate":"12/4/2019","type":"pardon","convictionDate":"1974","convictionCounty":"Laurel ","home":"East Bernstadt","bevinComments":"Johnny Burkhart has paid his debt to society.","charges":"Receiving stolen property charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1071-264938.pdf"},{"name":"Johnny Lee Perkins","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2014","convictionCounty":"Greenup","home":"Morehead","bevinComments":"Johnny Perkins has turned his life around in recent years after a history of addiction and criminal activity.","charges":"Forgery","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1142-264555.pdf"},{"name":"Johnny Mullins","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1974","convictionCounty":"Menifee","home":"Salt Lick","bevinComments":"Johnny Mullins has fully repaid any debt he owed  for  breaking  the law more than 45 years ago and since that time he has been a model citizen.","charges":"Store-house breaking","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1138-264551.pdf"},{"name":"Jonathan Dayton Ware","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2008, 2005","convictionCounty":"Pulaski, Casey","home":"Liberty ","bevinComments":"Jonathan Ware is a good family man and productive citizen. He has paid his debt to society.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1260-264443.pdf"},{"name":"Jonathan Lee Morris","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2010, 2005, 1998","convictionCounty":"Adair","home":"Nicholasville","bevinComments":"Since leaving a life of addiction years ago, Jonathan Morris has done all that society has asked of him. He is a loving husband and father and a dedicated, hard-working business owner and tax-payer.","charges":"Theft and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1137-264550.pdf"},{"name":"Joseph Ryan Chambers","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2014, 2001, 2003","convictionCounty":"Jefferson, Fayette","home":"[Blank]","bevinComments":"Joseph Chambers nearly threw his life away through addiction and criminal activity. Since being incarcerated he has turned his life around and has proven himself to be a valuable friend and mentor to others. I encourage Joe to pursue his interest in prison ministry and meaningful criminal justice reform. His voice and experience will provide him the insight and ability to affect real change; and it is my privilege to allow Mr. Chambers the greatest possibility to pursue his next steps in life by commuting any remaining sentencing obligation and granting him the full pardon he has requested.","charges":"Robbery and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1262-264379.pdf"},{"name":"Joshua David Fackler","orderDate":"12/3/2019","type":"Pardon","convictionDate":"2002","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Joshua Fackler has turned his life around and has done what society has asked of him since his violation of the law. He is a husband, father, employer, tax-payer and model citizen; and it is my privilege to grant him the full and unconditional pardon that he has requested. I am confident that he will use every opportunity in the years ahead to pour back into the lives of others who need a second chance.","charges":"Burglary","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1046-264353.pdf"},{"name":"Joshua Franklin Sulfridge","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2006, 1999, 1998","convictionCounty":"Laurel","home":"Heiskell, TN","bevinComments":"Joshua Sulfridge is a good husband, father and community citizen. He has turned his life around and has become a role model for others. He is blessed to have a wife who  loves him and can write a compelling letter on his behalf.","charges":"Possession of handgun, burglary, criminal mischief and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1158-264571.pdf"},{"name":"Judy Elizabeth Lee","orderDate":"11/21/2019","type":"Pardon","convictionDate":"2009","convictionCounty":"Edmonson","home":"Bowling Green","bevinComments":"Ms. Lee is a survivor of domestic violence who was formerly incarcerated for killing her abuser. She was issued a commutation of sentence to time served in 2015. So that Ms. Lee can move forward in her life unfettered by her conviction, I am pleased to grant her the full and unconditional pardon that she has requested: NOW, THEREFORE, I, Matthew G. Bevin, Governor of the Commonwealth of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby unconditionally pardon Judy Elizabeth Lee and return to her all rights and privileges of a citizen of this Commonwealth.","charges":"Manslaughter and tampering with evidence charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0914-264045.pdf"},{"name":"Justin Derrick Wibbels","orderDate":"11/22/2019","type":"Pardon and Commutation","convictionDate":"2015","convictionCounty":"Laurel ","home":"[blank]","bevinComments":"Justin was involved in a tragic accident and has been incarcerated as a result of his conviction for wanton murder. This was not a murder. NOW, THEREFORE, I, Matthew G. Bevin, Governor of the Commonwealth of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby commute the sentence of Justin Derrick Wibbels to time served and simultaneously grant him a full and unconditional pardon and return to him all rights and privileges of a citizen of this Commonwealth.","charges":"Wanton murder charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0918-264048.pdf"},{"name":"Justin Steele McIntosh","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2003","convictionCounty":"Franklin","home":"Frankfort","bevinComments":"Justin McIntosh made an unwise decision nearly 20 years ago and it resulted in a criminal conviction. Since that time, Justin has turned his life around and has become a model husband, father, employee and community citizen.","charges":"Robbery","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1128-264542.pdf"},{"name":"Kathryn Brooke Jones","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2009, 2008, 2006, 2005, 2004","convictionCounty":"Jefferson, Hardin","home":"[Blank]","bevinComments":"Kathryn B. Jones made a series of poor decisions in her younger life that were fueled by her addiction and led to the criminal activity for which she is now incarcerated. Prison has saved her life and changed her as a person. She is no longer the woman she was a decade ago; and because she will be a more effective wife, mother and member of society outside of prison and because the rehabilitation of her life has been accomplished as much as time in prison can contribute; NOW, THEREFORE, I, Matthew G. Bevin, Governor of  the  Commonwealth  of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby commute the sentence of Kathryn Brooke Jones a/k/a Kathryn Brooke Sauer to time served and simultaneously grant her a full and unconditional pardon and return to her all rights and privileges of a citizen of this Commonwealth, with the expectation that she will spend the rest of her life giving back and assisting others to the best of her ability.","charges":"Robbery, persistent felony offender, fraud and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1222-264388.pdf"},{"name":"Kathy Ann Harless","orderDate":"12/9/2010","type":"Pardon & Commutation","convictionDate":"2003","convictionCounty":"Grayson","home":"","bevinComments":"Kathy Harless has paid enough for the death of her new-born son.","charges":"Murder and tampering with physical evidence","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1291-264403.pdf"},{"name":"Kayla Gail McClure","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2016","convictionCounty":"Madison","home":"Cumberland","bevinComments":"Kayla McClure is a good woman, a good friend and a good role model to others for how to turn a broken life around.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1126-264540.pdf"},{"name":"Kayla Marie Parsons","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2013","convictionCounty":"Boyd","home":"Louisa","bevinComments":"Kayla Parsons is a natural leader and has turned  away from her previous life of addiction and criminal activity. She is a great wife, mother, employee and community citizen. ... (I)t is my privilege to grant her the full and unconditional pardon that she has requested. I am confident that she will do great things with her life in the years ahead.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1141-264554.pdf"},{"name":"Kayla Rose Walsh","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2006, 2005","convictionCounty":"Trigg, Graves","home":"Midway","bevinComments":"Kayla Walsh has been on a mission for the past 13 years to put her life back on track and she has succeeded brilliantly. Her drive to improve her life and her community is admirable and serves as an example for others to follow.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1260-264443.pdf"},{"name":"Keith West","orderDate":"12/9/2019","type":"Pardon","convictionDate":"1997","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"I hereby grant Keith West the full and unconditional pardon  he  has  requested.","charges":"Manslaughter charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1348-264473.pdf"},{"name":"Kellee Clara Martin","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2000, 1993","convictionCounty":"Henderson","home":"Robards","bevinComments":"Kellee Martin is a woman who has turned her life around and has accomplished impressive things. She has paid her debt to society and has become an upstanding citizen.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1124-264538.pdf"},{"name":"Kelsie Claire Guenther","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2015","convictionCounty":"Boone","home":"Independence","bevinComments":"Kelsie Guenther has turned her life of addiction and fraud into one that is productive, beautiful and an example to others.","charges":"Theft","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1248-264430.pdf"},{"name":"Kenneth Larry Brady","orderDate":"11/22/2019","type":"Pardon","convictionDate":"1976","convictionCounty":"Boyle","home":"Lawrenceburg","bevinComments":"Kenneth Brady made a foolish decision as a teenager, was convicted and sentenced and long ago paid his full debt to society. Since that time he has been an exemplary husband, father and public servant; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Criminal facilitation, theft and burglary charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0936-264112.pdf"},{"name":"Kenneth Monroe Sowers","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1989","convictionCounty":"Fayette","home":"Lexington","bevinComments":"Kenneth Sowers made some unwise decisions 30 years ago but paid his debt  to society and turned his life around. He is an upstanding citizen and a blessing to his community. His wife and parents have every reason to be proud of the man Ken Sowers has become.","charges":"Forgery charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1152-264565.pdf"},{"name":"Kenneth Neal Benham","orderDate":"11/25/2019","type":"Pardon","convictionDate":"1973","convictionCounty":"Meade","home":"Brandenburg","bevinComments":"Kenneth Benham when he was 17 years old, caused a fatal accident due to driver error and bad judgment nearly 50 years ago. He has long ago completed all that was asked of him by the courts and has since lead a law-abiding life; and it is my privilege to grant Kenneth the full and unconditional pardon that he has requested.","charges":"Involuntary manslaughter charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0933-264109.pdf"},{"name":"Kevin Douglas Melton","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2007","convictionCounty":"Bell","home":"Middlesboro","bevinComments":"More than 10 years ago, Kevin Melton made a series of poor choices that resulted in his criminal conviction. Since then he has turned his life around and has become the type of man, father and employee that others look up to.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1130-264922.pdf"},{"name":"Kristen Suzanne Flannery","orderDate":"11/27/2019","type":"Pardon","convictionDate":"2012","convictionCounty":"Rowan","home":"Morehead","bevinComments":"Kristen Flannery has been doing all that has been asked for her since returning to society in recent years. She has learned powerful lessons from her conviction for past behavior and has turned her life around; and so that she can fully be the woman and mother that she was created to be, it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0965-264164.pdf"},{"name":"Kristie Le-Na Pierce","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2013, 2009","convictionCounty":"Warren","home":"Bowing Green","bevinComments":"Kristie Pierce has turned  her life around in recent years.  Her efforts  to stay on a positive course are made difficult by the baggage of past convictions. ... (B)ased on her application, her stated desire for a fresh start and the support from others in her community, it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Theft and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1143-264556.pdf"},{"name":"Kurt Robert Smith","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2002","convictionCounty":"Fayette","home":"[Blank]","bevinComments":"Kurt Smith has been duly punished for his criminal actions more than eighteen years ago; and I hereby commute his sentence to time served and pardon him for his actions. I am confident that he will become a productive member of society and encourage him to use his life experience to educate and help others.","charges":"Murder","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1274-264383.pdf"},{"name":"LaQuetta Crezel Ferguson","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2011, 2009, 1998","convictionCounty":"Fayette","home":"Lexington","bevinComments":"LaQuetta Ferguson has turned her life around and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1354-264468.pdf"},{"name":"Larry Michael Leffler","orderDate":"12/4/2019","type":"Pardon","convictionDate":"1982","convictionCounty":"Kenton","home":"Williamstown","bevinComments":"Larry Leffler broke the law more than 35 years ago and has lived  in exemplary life since that time. He is an upstanding citizen and paid his debt to society long ago.","charges":"Robbery and theft by unlawful taking","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1086-264953.pdf"},{"name":"Larry Robert Watson","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1999, 1990","convictionCounty":"Barren, Monroe","home":"Tompkinsville","bevinComments":"(No explanation given)","charges":"Flagrant non-support and theft by unlawful taking","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1162-264575.pdf"},{"name":"Laurie R. Andrade","orderDate":"11/21/2019","type":"Pardon","convictionDate":"2010","convictionCounty":"Adair","home":"Lexington","bevinComments":"Ms. Andrade is a survivor of domestic violence who was formerly incarcerated for killing her abuser. She was issued a commutation of sentence to time served in 2015. So that Ms. Andrade can move forward in her life unfettered by her conviction, I am pleased to grant her the full and unconditional pardon that she has requested: NOW, THEREFORE, I, Matthew G. Bevin, Governor of the Commonwealth of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby unconditionally pardon Laurie R. Andrade and return to her all rights and privileges of a citizen of this Commonwealth.","charges":"Reckless homicide charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0912-264043.pdf"},{"name":"Lee Edward, Jr.","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2014, 2011, 2007, 2008","convictionCounty":"Mercer, Harlan, Letcher","home":"Harrodsburg","bevinComments":"Lee Edward Early, Jr. has turned his life around and is serving his community in a exemplary way.","charges":"Theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1240-264423.pdf"},{"name":"Leif Christian Halvorsen","orderDate":"12/9/2019","type":"Commutation ","convictionDate":"1983","convictionCounty":"Fayette","home":"","bevinComments":"(No explanation given)","charges":"Three counts of murder, robbery and weapons charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1357-264462.pdf"},{"name":"Linda Fay Loy","orderDate":"11/21/2019","type":"Pardon","convictionDate":"1997","convictionCounty":"Franklin","home":"Frankfort","bevinComments":"A generation ago, Linda Loy made mistakes for which she was prosecuted and held to account. Since that time, she has fully paid her debt to society and has turned her life around. She is an upstanding citizen and a model to others in her community; and it is my privilege to grant Linda the full and unconditional pardon that she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0911-264040.pdf"},{"name":"Lindsay Carol Horseman","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2010, 2006","convictionCounty":"Clark","home":"Winchester","bevinComments":"Lindsay Horseman has turned her life around after a period of addiction and criminal behavior. She has become a model citizen and a shining example to others.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1265-264446.pdf"},{"name":"Loretta A. Smith","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2013","convictionCounty":"Floyd","home":"Louisa","bevinComments":"Loretta Smith lost control of her life for a period of time some years ago due  to addiction and its criminal ripple effect. Her journey back to sobriety and responsibility is impressive and serves as a great example for others to follow. She has a bright future ahead of her and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1150-264563.pdf"},{"name":"Marcus Keith Baird, Jr","orderDate":"11/19/2019","type":"Pardon","convictionDate":"1979, 1980, 1983","convictionCounty":"Daviess","home":"El Paso, CO","bevinComments":"Marcus Baird is an incredible example of a life that has been turned around. His passionate service to others and his commitment to lifting up those who have fallen, is truly commendable; and It is my privilege to provide Marcus with the full and unconditional pardon that he has requested and deserves.","charges":"Burglary, theft and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0871-263891.pdf"},{"name":"Marcus Keith Baird, Jr.","orderDate":"11/25/2019","type":"Pardon","convictionDate":"1979, 1980, 1983, 1985","convictionCounty":"Daviess","home":"El Paso, CO","bevinComments":"Marcus Baird is an incredible example of a life that has been turned around. His passionate service to others and his commitment to lifting up those who have fallen, is truly commendable; and it is my privilege to provide Marcus with the full and unconditional pardon that he has requested and deserves.","charges":"Burglary, theft and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0952-264134.pdf"},{"name":"Marie Minix","orderDate":"12/9/2019","type":"Pardon & Commutation","convictionDate":"2014","convictionCounty":"Magoffin","home":"[blank]","bevinComments":"(No explanation given)","charges":"Reckless homicide","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1344-264460.pdf"},{"name":"Mark Anthony Hall","orderDate":"11/21/2019","type":"Pardon","convictionDate":"1981","convictionCounty":"Bracken","home":"Falmouth","bevinComments":"Mark Hall has clearly turned his life around since he was a young man. He has spent the past several decades as a valuable, contributory member of his community and has become an exemplary, upstanding citizen; and it is a privilege to grant Mr. Hall the full and unconditional pardon that he has requested.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0906-264035.pdf"},{"name":"Mary Julia Tinsley","orderDate":"12/9/2019","type":"Pardon","convictionDate":"1998","convictionCounty":"Franklin","home":"Falmouth","bevinComments":"Mary Tinsley has paid her debt to society and has been a valuable and productive citizen for the past 20 years.","charges":"More than 100 theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1286-264413.pdf"},{"name":"Matthew Ryan Cleveland","orderDate":"11/22/2019","type":"Pardon","convictionDate":"2010, 2009, 2007","convictionCounty":"Fayette, Henderson","home":"Henderson","bevinComments":"After a period of troubled years marked by several criminal convictions, Matthew Cleveland has clearly turned his life around. His strong work ethic and service to his family, church and community are an example for others to follow; and it is my privilege to provide Matt with the full and unconditional pardon that he has requested.","charges":"Alcohol intoxication, disorderly conduct, fleeing police and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0932-264108.pdf"},{"name":"Matthew Wayne Green","orderDate":"11/27/2019","type":"Pardon","convictionDate":"2009","convictionCounty":"Owsley","home":"Beattyville","bevinComments":"Matthew Green made a number of poor decisions as a young man for which he has been convicted and sentenced. He has, by all indication, made a complete turn in his life and is charting a new course with his family. I encourage him to be a model citizen for his children and community to emulate; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Trafficking charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0969-264168.pdf"},{"name":"Max Jackson Sterling","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2016, 2009, 2004","convictionCounty":"Bourbon","home":"Lexington","bevinComments":"Max Sterling is a good husband, a good father and a good, hardworking employee. He has turned his life around in recent years and is leading his family is a positive direction. I encourage Max to slow down and buckle-up while driving (seriously!) and I consider it a privilege to grant him the full and unconditional pardon that he has requested.","charges":"Criminal littering","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1156-264569.pdf"},{"name":"Melissa Jean Wagoner","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2011","convictionCounty":"Bourbon","home":"Berea","bevinComments":"(No explanation given)","charges":"Drug and forgery charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1259-264441.pdf"},{"name":"Melissa Nicole Roberts","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2018","convictionCounty":"Powell","home":"Stanton","bevinComments":"Melissa Roberts defended herself  with  deadly consequences.  She did what she had to do.","charges":"Manslaughter","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1325-264926.pdf"},{"name":"Mellissa A. Askew","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1995","convictionCounty":"McCracken","home":"Paducah","bevinComments":"Mellissa Askew made a poor decision nearly 25 years ago and was ultimately charged and convicted for breaking the law. She has fully paid her debt to society; and it is my privilege to grant her the full and unconditional pardon she has requested.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0994-264235.pdf"},{"name":"Melton Middleton","orderDate":"11/22/2019","type":"Pardon","convictionDate":"2008, 2007, 2005, 2004","convictionCounty":"Harlan","home":"Harlan","bevinComments":"Melton Middleton has turned his life around and has become a great example for others to follow. His dedication to his community are a blessing to many. He was raised in a good home and, with the exception of a few rocky years, he has lived a life honoring those who raised and educated him; and it is my privilege to grant Melton the full and unconditional pardon that he has requested.","charges":"Drug, weapons, theft and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0928-264104.pdf"},{"name":"Micah Culver Schoettle","orderDate":"12/9/2019","type":"Pardon & Commutation","convictionDate":"2018","convictionCounty":"Kenton","home":"","bevinComments":"Micah Schoettle was tried and convicted of a heinous crime based only on testimony that was not supported by any physical evidence. In fact, any and all evidence that is available, refutes the allegations that were made. This case was investigated and prosecuted in a manner that was sloppy at best. I do not believe that the charges against Mr. Schoettle are true.","charges":"Rape, incest, sexual abuse, sodomy and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1346-264444.pdf"},{"name":"Michael A. Lyles","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1993, 1992, 1990","convictionCounty":"Fayette","home":"Lexington","bevinComments":"For more than 25 years, Michael Lyles has charted a new direction in his life\nand has become an upstanding citizen and a role model for others.","charges":"Assault, weapons drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1251-264433.pdf"},{"name":"Michael Andrew Hardy","orderDate":"12/9/2019","type":"Pardon & Commutation","convictionDate":"2016","convictionCounty":"Warren","home":"","bevinComments":"Michael Hardy will arise each day for the rest of his life with a debt that he cannot possibly repay. Every day he will remember how his actions resulted directly in the death of an innocent man. I do not believe that society, as a whole, or the memory of Jeremy Pryor more specifically, will be best served by the continued incarceration of Mr. Hardy; and ... with the expectation that he will use his factual decision as a teachable lesson for others of all ages (but especially young people): I, Matthew G. Bevin, Governor of the Commonwealth  of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby commute the sentence of Michael Andrew Hardy to time served. Additionally, based on his acceptance, I offer Michael Hardy the following conditional pardon: 1. He must refrain from any consumption of alcohol and; 2. That he share his story and the name of Jeremy Pryor in schools, churches and other gatherings no less than six times per year for at least the next 20 years.\n","charges":"Murder, Wanton endangerment and criminal mischief charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1290-264402.pdf"},{"name":"Michael Anthony Clark","orderDate":"12/4/2019","type":"Pardon ","convictionDate":"2017, 2016, 2013, 2010, 1999","convictionCounty":"Harlan, Fayette","home":"Cumberland","bevinComments":"After many years of addiction and criminal activity, Michael A. Clark has turned his life around. He now serves as a role model and mentor to others who are going through recovery.","charges":"Drug and other chargers","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1073-264940.pdf"},{"name":"Michael Anthony O'Bryan","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2004","convictionCounty":"Breckinridge","home":"Union Star","bevinComments":"Michael O'Bryan made a series of poor decisions 15-20  years ago and was held accountable for his actions in a court of law. .. (S)ince that time, he has turned his life around and it it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Drug and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1122-264536.pdf"},{"name":"Michael Bradley Skeirik Jr.","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1995","convictionCounty":"Grant","home":"Fairfield, CA","bevinComments":"Michael Skeirik made some unwise decisions 25 years ago and they resulted in criminal consequences. Since that time he has done all that society has asked of him and then some. He is an upstanding citizen and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Burglary charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1148-264561.pdf"},{"name":"Michael Chad Barkley","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2008","convictionCounty":"Jefferson ","home":"Louisville","bevinComments":"Michael Barkley hit rock bottom and decided to turn  his life around.  Since that time, that is exactly what he has done. As a father, a student, an employee and an upstanding citizen, he sets a powerful example for others to follow.","charges":"Burglary charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1281-264457.pdf"},{"name":"Michael Huey Abbott","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2011","convictionCounty":"Warren","home":"Monticello","bevinComments":"Michael Abbott made a bad decision years ago that led to his conviction and incarceration. He has paid his debt to society, his restitution to the victim and he is now a hard-working, law-abiding, tax-paying, God-fearing member of society; and it is my privilege to grant Mr. Abbott the full and unconditional pardon that he has requested. I am confident that he has a bright and significant future ahead of him.","charges":"Assault, wanton endangerment, and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0987-264228.pdf"},{"name":"Michael Kymel Jackson","orderDate":"12/6/2019","type":"Pardon ","convictionDate":"2001","convictionCounty":"Fayette","home":"Lexington","bevinComments":"Michael Jackson is a new man. Having turned his life around over the  past two decades, he has become a truly exemplary citizen. His service to others in his community is a good example for others to follow.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1250-264432.pdf"},{"name":"Michael Steven Mills","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1993","convictionCounty":"Graves","home":"Mayfield","bevinComments":"Michael Mills has turned his life around in recent decades and has become an upstanding public employee and a model citizen.","charges":"Assault","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1134-264547.pdf"},{"name":"Misty Renee Breeding","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2014, 2008, 2008, 2003, 2003","convictionCounty":"Clark, Fayette, Knox","home":"Winchester","bevinComments":"Misty Breeding is a hardworking, dedicated wife, mother, employee, friend and citizen. She should be proud of the new direction she has charted in recent years.","charges":"Drug and terroristic threatening","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1234-264417.pdf"},{"name":"Nathan Alan Blaydes","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2004, 2004","convictionCounty":"Taylor, Green","home":"Greensburg","bevinComments":"Nathan Blaydes made a series of poor decisions many years ago for which he was tried and convicted. He has paid his debt to society and, in recent years, has turned his life around and become a model husband, father and community citizen; and it is my privilege to grant Mr. Blaydes the full and unconditional pardon that he has requested.","charges":"Rape, burglary and criminal mischief charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0995-264236.pdf"},{"name":"Nathan Thomas Autry","orderDate":"12/3/2019","type":"Pardon","convictionDate":"2009","convictionCounty":"Ohio","home":"Beaver Dam","bevinComments":"Nathan Autry made a foolish decision 10 years ago and took something that did not belong to him. He has paid his debt to society; and Nathan Autry is being granted the full and unconditional pardon that he as requested. I am confident that he will use this opportunity for a fresh start to live his life in a manner that sets a good example for his son and others to follow.","charges":"Burglary and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1041-264348.pdf"},{"name":"Patrick Brian Baker","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2017","convictionCounty":"Knox","home":"[Blank]","bevinComments":"Patrick Baker is a man who has made a series of unwise decisions in his adult life. His drug addiction resulted in his association with people that in turn led to his arrest, prosecution and conviction for murder. the evidence supporting his conviction is sketchy at best. I am not convinced that justice has been served on the death of Donald Mills, nor am I convinced that the evidence has proven the involvement of Patrick Baker as murderer; and I am commuting Mr. Baker's sentence  to time served and providing him with a pardon only for charges associated with this conviction: NOW, THEREFORE, I, Matthew G. Bevin, Governor of the Commonwealth  of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby commute the sentence of Patrick Brian Baker to time served and simultaneously grant him a full and unconditional pardon and return to him all rights and privileges of a citizen of this Commonwealth.","charges":"Murder, robbery and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1272-264381.pdf"},{"name":"Patrick Dion Gordon","orderDate":"11/27/2019","type":"Pardon","convictionDate":"1990","convictionCounty":"Fayette","home":"Warren","bevinComments":"Patrick Gordon has fully paid his debt to society related to the crime he committed nearly 30 years ago. His hard work and clean record since that time provide a good example to other returning citizens; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Trafficking charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0968-264167.pdf"},{"name":"Paul Donel Hurt","orderDate":"11/22/2019","type":"Pardon and Commutation","convictionDate":"2001","convictionCounty":"Jefferson","home":"[blank]","bevinComments":"Hindsight is never truly 20/20, but it appears to me, and to many others including the judge who sentenced him, that Paul Donel Hurt has been wrongly convicted and imprisoned for nearly 20 years. In light of all that is known and all that will forever remain unknown, it does not seem possible that justice can be truly served in this instance. Nonetheless, with the power vested in me as Governor of the Commonwealth of Kentucky, I believe it is my moral duty to commute the remaining sentence of Paul Donel Hurt and to grant him the full and unconditional pardon that he has requested; and It is my fervent hope and prayer that Mr. Hurt will find his faith in God and in his fellow man restored, and that he and his family will be abundantly blessed as he experiences the restoration of his freedom in the years ahead ...","charges":"Multiple counts of sodomy and sexual abuse","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0919-264049.pdf"},{"name":"Paul Tyler LaRue","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2009","convictionCounty":"Jefferson, Hardin","home":"Sonora","bevinComments":"Paul LaRue made some unwise decisions as a young man and was criminally prosecuted as a result. For the past decade, he has turned his life around and has become a model citizen and a role model for many.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1084-264951.pdf"},{"name":"Pearlie Sue Gambrel","orderDate":"11/21/2019","type":"Pardon","convictionDate":"1998","convictionCounty":"Knox","home":"Flat Lick","bevinComments":"Ms. Gambrel is a survivor of domestic violence who was formerly incarcerated for killing her abuser. She was issued a commutation of sentence to time served in 2015. So that Ms. Gambrel can move forward in her life unfettered by her conviction, I am pleased to grant her the full and unconditional pardon that she has requested: NOW, THEREFORE, I, Matthew G. Bevin, Governor of the Commonwealth of Kentucky, in consideration of the foregoing, and by the virtue of the authority vested in me by Sections 77, 145, and 150 of the Constitution of the Commonwealth of Kentucky, do hereby unconditionally pardon Pearlie Sue Gambrel and return to her all rights and privileges of a citizen of this Commonwealth.","charges":"Manslaughter and arson charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0913-264044.pdf"},{"name":"Randall Ozment Carter","orderDate":"11/21/2019","type":"Pardon","convictionDate":"1987","convictionCounty":"Hart","home":"Caneyville","bevinComments":"Randall Carter is a man who has served his nation, his community and his family with dignity and pride. I am personally grateful to men like Mr. Carter who have placed others ahead of themselves and have served our nation with honor; and it is my privilege to grant Randall the full and unconditional pardon that he has requested.","charges":"Assault charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0908-264037.pdf"},{"name":"Randell Bruce Goins","orderDate":"12/1/2019","type":"Pardon","convictionDate":"2004, 2002, 2001","convictionCounty":"Bell","home":"Cumberland Gap, TN","bevinComments":"Randell Goins made a series of decisions to break the law some years ago. Since then, he has helped fight against the prison bureaucracy and has progressed well in his efforts to turn his life around and to serve others. I expect that Mr. Goins will do great things for his family, his community and for Kentucky in the years ahead; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Drug and fraud charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1011-264252.pdf"},{"name":"Rebecca Sue Myers\r","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2003","convictionCounty":"Hardin","home":"Lebanon","bevinComments":"Rebecca Myers has much to be proud of in her life. She has turned herself completely around over the past decade and is a great wife, mother, grandmother, employee and citizen.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1139-264552.pdf"},{"name":"Renita Lynn Lanham","orderDate":"12/6/2019","type":"","convictionDate":"2004, 2002, 1999","convictionCounty":"Madison ","home":"Berea","bevinComments":"Renita Lanham made some poor decisions 15 years ago and was held to account. Since that time she has been all that anyone would expect of a model citizen. She is a good mother, a hard worker, a good friend and a good Kentuckian; and she has paid any debt that she ever owed to society and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1047-264354.pdf"},{"name":"Richard A. Bailey","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1997","convictionCounty":"McCracken ","home":"Georgetown","bevinComments":"Richard Bailey made some unwise decisions more than 20 years ago. Before and after that time he has been a productive citizen in his community\n.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1232-264415.pdf"},{"name":"Richard A. Lambe","orderDate":"11/22/2019","type":"Pardon","convictionDate":"1982","convictionCounty":"Hardin","home":"Lesage, WV","bevinComments":"Richard Lambe made a bad decision more than 35 years ago for which he was prosecuted and punished. He has fully paid his debt to society. Since that time he has lived an exemplary life in service to his family and to many others in his church and community; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Wanton endangerment charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0927-264103.pdf"},{"name":"Ricky Lee Agee","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2005","convictionCounty":"Madison","home":"Berea","bevinComments":"Ricky Agee made a poor decision 15 years ago for which he was punished and long ago paid his debt to society; and his record was previously expunged, but at his request, it is my privilege to grant him a full and unconditional pardon.","charges":"Cultivation of marijuana charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0990-264231.pdf"},{"name":"Robbie Dwain Allen","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2012, 2008","convictionCounty":"Knott, Flloyd","home":"Dema","bevinComments":"Robbie D. Allen has paid his debt to society after being convicted for his criminal actions in years past. ... (H)e is being granted  the full and  unconditional  pardon  that he has requested. I encourage him to continue charting the straight course in life and use this new lease on life to help improve the lives of those around him.","charges":"Assault and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1061-264929.pdf"},{"name":"Robert Allen Lewis","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2009","convictionCounty":"Franklin","home":"Lexington","bevinComments":"Robert Lewis has regained  his sobriety and his life over the past decade and  is now a good citizen and strong contributor to society.","charges":"Wanton endangerment","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1088-264955.pdf"},{"name":"Robert Ernest Hull","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2000, 1993","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Robert Hull has paid his debt to society and is a great example to others about how a positive outlook and perseverance built on a strong foundation of faith and family can change a persons life for the better. Mr. Hull is a model husband, father, businessman and community citizen; and it is my privilege to grant him the full and unconditional pardon that he has requested (p.s. slow down behind the wheel!)","charges":"Theft and fraud charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1019-264260.pdf"},{"name":"Robert Forrest Quillen","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2014, 2011, 2010, 2013","convictionCounty":"Letcher, Pike (last case in 2013)","home":"Manchester","bevinComments":"Robert Quillen is a changed man m recent years and is admired  and  respected by many leaders in his community. ... (H)is attitude, work ethic and service  to  others are a good example  for others to follow and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Theft and criminal mischief charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1144-264557.pdf"},{"name":"Robert Louis Aaron Oppenheimer","orderDate":"12/9/2019","type":"Pardon","convictionDate":"1998","convictionCounty":"Boone","home":"Florence","bevinComments":"It is my sincere desire that with this new lease on life, Robert Oppenheimer  will straighten up and fly right and continue to develop into the productive citizen that he is capable of being.","charges":"Robbery","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1330-264475.pdf"},{"name":"Roger Kevin Large","orderDate":"12/4/2019","type":"Pardon","convictionDate":"1974","convictionCounty":"Hardin","home":"Elizabethtown","bevinComments":"Roger Large is a good man, a good husband, a good  father  and  a  good citizen. He paid any debt he owed to society long ago and has lived an exemplary life since  that time.","charges":"Grand larceny","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1083-264950.pdf"},{"name":"Roger Louis Mercer","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1968","convictionCounty":"Jefferson","home":"Leitchfield","bevinComments":"Roger Mercer made a bad decision more than 50 years ago. He was held accountable for breaking the law. Since that time, he has been a great husband, a great father and a great community citizen. He is a man with solid values, an impressive work ethic and a well-deserved good reputation. He has more than paid any debt that he owed to society; and it is my privilege to grant Roger Mercer the full and unconditional pardon that he has requested.","charges":"Armed robbery","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1048-264355.pdf"},{"name":"Ronald Dean Smith","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1995","convictionCounty":"Clay","home":"Yeaddiss","bevinComments":"Ronald Smith has paid his debt to society for crimes he committed many years in the past; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Flagrant non-support","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1023-264264.pdf"},{"name":"Ronald Eugene Ferrier","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2008","convictionCounty":"Kenton","home":"Erlanger","bevinComments":"Ronald Ferrier has fully paid whatever debt he may have owed to society.","charges":"Impersonating a peace officer","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1243-264425.pdf"},{"name":"Ronald Steve Johnson","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2014","convictionCounty":"Edmonson","home":"Brownsville","bevinComments":"Ronald S. Johnson used poor judgment with a result that hurt nothing and no one. He has fully paid any debt that he had to society arising from this incident; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Wanton endangerment","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1021-264262.pdf"},{"name":"Ronald Wayne Gilkerson","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2001, 1978","convictionCounty":"Fayette, Mason","home":"Lexington","bevinComments":"Ronald Gilkerson was convicted of a single felony more than 40 years ago and two misdemeanors more than 18 years ago. He has fully paid any debt that he owes to society; and it is my privilege to grant Mr. Gilkerson the full and unconditional pardon that he has requested.","charges":"Theft and robbery charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1010-264251.pdf"},{"name":"Ronnie Spencer","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2002","convictionCounty":"Montgomery","home":"Stanton","bevinComments":"Many years ago, Ronnie Spencer made an unwise decision that resulted in criminal consequences. Since that time, he has turned his life around and now serves his community as a volunteer and is an upstanding citizen","charges":"Drug chages","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1153-264566.pdf"},{"name":"Saiyd Amir Joyce","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2002","convictionCounty":"Fayette","home":"Paducah","bevinComments":"Saiyd Joyce has lived an exemplary adult life after getting off track in his earlier years. His dedication to bettering himself and serving others is impressive. ... (I)t is my privilege to grant him the full and unconditional pardon that he has requested. I am confident that he will do even greater things for others in the years ahead.","charges":"Burglary","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1120-264534.pdf"},{"name":"Salina Renee Wells","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2013","convictionCounty":"Johnson ","home":"Louisa","bevinComments":"Salina Wells has turned away from the lawlessness and addiction that had dominated her life for years. She now serves others who are struggling as she once did and she has become an upstanding citizen and a role model; and it is my privilege to grant Salina the full and unconditional pardon that she has requested.","charges":"Second offense DUI and endangering the welfare of a minor","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1025-264266.pdf"},{"name":"Samantha Jean Dowden","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2010, 2009","convictionCounty":"Lawrence","home":"Prichard, WV","bevinComments":"Samantha Dowden has turned her life around in an impressive way and is a valuable member of society. It is my belief that she will continue to serve others around her for  years to come as a role model worthy of emulation.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1238-264421.pdf"},{"name":"Sara Dawn Young","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2012, 2011, 2007","convictionCounty":"Lawrence","home":"Louisa","bevinComments":"Sara Young is a blessing to her family, friends and co-workers. She has learned from past mistakes and criminal convictions and she has turned her life around; and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Theft and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1026-264267.pdf"},{"name":"Sarah Frances Avery","orderDate":"12/3/2019","type":"Pardon","convictionDate":"2009, 2003, 2001, 2002, 2001, 2001","convictionCounty":"Muhlenburg, Henderson, Hopkins, Brecknridge","home":"Central City ","bevinComments":"Sarah Avery battled addiction and its many law/breaking effects for years. For the past decade, however, she has conquered her demons and has been an exemplary mother, friend, public servant and model citizen. As governor of Kentucky, I am proud of the woman she has become and how it reflects positively on our Commonwealth; and it is my privilege to grant Sarah the full and unconditional pardon that she as requested.","charges":"Drug, theft and persistent felony offender charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1042-264349.pdf"},{"name":"Scott Alan Fiala","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1993","convictionCounty":"Union ","home":"Enfield, IN","bevinComments":"Scott Fiala has paid his debt to society and has become a good husband, father, employee and citizen.","charges":"Burglary and theft","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1244-264426.pdf"},{"name":"Scottie Dale Morgan","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2005, 2000, 2000, 1996","convictionCounty":"Hardin, Muhlenberg, Christian (last 2 cases)","home":"Greenville","bevinComments":"Scottie Morgan is a good husband, father, employee,  boss,  example  for others and an upstanding citizen. He has turned away from a life of addiction and has  moved forward in a positive new direction. ... (H)e is an inspiration to others and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1136-264549.pdf"},{"name":"Shane Blake Smith","orderDate":"11/22/2019","type":"Pardon","convictionDate":"2003, 2005, 2004","convictionCounty":"Monroe, Barren","home":"Glasgow","bevinComments":"Shane Smith made a series of poor and often criminal decisions as a young man. In recent years he has been a hardworking, taxpaying member of his community; and in recognition of the way in which he has turned his life around, it is my privilege to grant Shane the full and unconditional pardon that he has requested.","charges":"Drug, wanton endangerment, theft and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0934-264110.pdf"},{"name":"Shane Lee Harrison","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2000","convictionCounty":"Jackson","home":"McKee","bevinComments":"Shane Harrison made a number of poor choices through his early adulthood years. In recent years he has turned his life around and works hard to provide for his family while also serving admirably in defense of others through his work as a firefighter. His work in protecting others reflects well on him and on Kentucky; and it is my privilege to provide Shane with the full and unconditional pardon that he has requested.","charges":"Fourth offense DUI","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1013-264254.pdf"},{"name":"Shari Lee Hays","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2007","convictionCounty":"Boone","home":"Dry ridge","bevinComments":"Shari Hays made some poor decisions more than 10 years ago and was appropriately tried and convicted. Since that time she has done all that was asked of her and has fully paid her debt to society. Her life and her attitude serve as a shining example to others and her service to others is a blessing to her community; and it is my privilege to grant Shari the full and unconditional pardon that she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1015-264256.pdf"},{"name":"Shawn Ann Howell","orderDate":"11/22/2019","type":"Pardon","convictionDate":"1993","convictionCounty":"Pulaski","home":"Somerset","bevinComments":"Ms. Howell is a good mother, a good citizen, a good employee and with one notable lapse in judgement more than 25 years ago, a life well lived; and it is my privilege to grant Shawn the full and unconditional pardon that she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0931-264107.pdf"},{"name":"Sonny Gilbert Hall","orderDate":"11/27/2019","type":"Pardon","convictionDate":"1986","convictionCounty":"Pike","home":"Pikeville","bevinComments":"More than 30 years ago, Sonny Hall broke the law and was duly punished. Since that time he has lived an exemplary life and serves as a living testament to the possibility of turning ones life around; and it is my privilege to grant Mr. Hall the full and unconditional pardon that he has requested.","charges":"Burglary charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0972-264171.pdf"},{"name":"Stephen Ray Hirschauer","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2004, 2005, 2002, 2000","convictionCounty":"Jefferson","home":"Sellersburg","bevinComments":"Stephen Hirschauer has turned his life completely around after an early adulthood of criminal behavior. He is a model husband, father, employee and community citizen and is a great example to other returning citizens; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Weapons, theft and drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1020-264261.pdf"},{"name":"Steven Allen Brown","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2008, 1996","convictionCounty":"Boone, Kenton","home":"Florence","bevinComments":"Steven A. Brown has paid his debt to society. He is a good husband, father, grandfather, employer and citizen.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1069-264936.pdf"},{"name":"Steven L. Phelps","orderDate":"12/9/2019","type":"Pardon","convictionDate":"1995","convictionCounty":"Pulaski","home":"Somerset","bevinComments":"Steven L. Phelps has paid his debt to society.","charges":"Assault","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1280-264455.pdf"},{"name":"Steven Matthew Baker","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2010, 2009, 2006, 2008","convictionCounty":"McCracken, Crittenden","home":"West Paducah","bevinComments":"Steven Baker has turned his life in a new and positive direction.","charges":"Drug, assault and weapon charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1233-264416.pdf"},{"name":"Steven Vincent Kidd","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2009, 2007, 2006","convictionCounty":"Rowan","home":"Owensboro","bevinComments":"Steven Kidd made a series of foolish and criminal choices as a young man  and was appropriately held to account for breaking the law. Since that time, he has turned his life around and has become a model husband, father, employee and citizen. He has done all that society has asked of him and more.","charges":"Drug, burglary and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1080-264947.pdf"},{"name":"Tami Eve Earlywine","orderDate":"11/21/2019","type":"Pardon","convictionDate":"2006, 2001, 2000","convictionCounty":"Lewis","home":"Vanceburg","bevinComments":"When Tami Earlywine was a younger woman with a different last name, she made a series of unwise and unlawful decisions for which she was appropriately held to account. Now, years later, she consistently makes a series of wise decisions that are evidence of having learned from her mistakes and her crimes and of having turned her life around; and for this reason, it is my privilege to grant her the full and unconditional pardon she has requested.","charges":"Hindering prosecution, resisting arrest, aggravated assault and harassment charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0907-264036.pdf"},{"name":"Tamishia Acc-enna Wilson","orderDate":"12/9/2019","type":"Pardon","convictionDate":"2006, 2004","convictionCounty":"Henderson","home":"Henderson","bevinComments":"Tamisha Wilson is a new woman. She has turned her life around and has become a model citizen.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1358-264465.pdf"},{"name":"Tammy Elaine Alexander","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2006, 1997","convictionCounty":"Warren","home":"Bowling Green","bevinComments":"Tammy Alexander is a new person. She has left her life of addiction and criminal activity behind and now serves as a role model for others; and she has paid her debt to society and it is my privilege to grant her the full and unconditional pardon she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0993-264234.pdf"},{"name":"Tammy Jo Lewis","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2015, 2010","convictionCounty":"Laurel, Knox","home":"London","bevinComments":"Tammy Lewis has turned her life around and has every reason to be proud of the woman she has become. ... (S)he now serves as a good role model for others and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1089-264956.pdf"},{"name":"Tanya Sue Burgess","orderDate":"12/2/2019","type":"Pardon","convictionDate":"2011","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Tanya Burgess had done a commendable job of turning her life around. After a difficult start and some poor decisions to break the law, she has overcome her addiction and proven what a strong and capable woman she is. Her commitment to her daughter, herself, her education and her employer(s) is a great example for others to follow; and it is my privilege to grant her the full and unconditional pardon that she has requested. I believe that she will do great things in her life in the years ahead.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1002-264243.pdf"},{"name":"Terrie Lee Frasure","orderDate":"11/27/2019","type":"Pardon","convictionDate":"2012","convictionCounty":"Grant","home":"Dry Ridge","bevinComments":"Terrie Frasure has overcome a difficult start in life and a series of drug offenses to become the woman she was created to be. She is a great mother, employee, example to others and community citizen; and her life serves as a model for others who are returning to society and it is my privilege to grant her the full and unconditional pardon that she has requested.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0966-264165.pdf"},{"name":"Terry Brandon Emory","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2011, 2010, 2008, 2003","convictionCounty":"Lawrence","home":"Louisa","bevinComments":"Terry \"Brandon\" Emory has turned his life around and now serves as a role model to others in recovery. He is a good husband, father and citizen.","charges":"Drug, theft and persistent felony offender charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1242-264424.pdf"},{"name":"Terry Edward Weathers","orderDate":"12/9/2019","type":"Pardon","convictionDate":"1999","convictionCounty":"Jefferson","home":"Crestwood","bevinComments":"Terry Weather paid his debt to society many years ago and has been a model citizen in recent decades.","charges":"Assault, wanton endangerment, criminal mischief charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1352-264470.pdf"},{"name":"Theresa Ann Dyre","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1992","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Theresa Dyre has turned her life completely around over the past 25+ years.\nShe has paid her debt to society.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1239-264422.pdf"},{"name":"Thomas Dwayne Adams","orderDate":"12/4/2019","type":"Pardon","convictionDate":"1993, 1990","convictionCounty":"Scott","home":"Georgetown","bevinComments":"Thomas D. Adams has paid his debt to society and has lived for many years  as a good husband, father, employee and citizen.","charges":"Theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1060-264928.pdf"},{"name":"Thomas Earl Barker","orderDate":"12/3/2019","type":"Pardon","convictionDate":"1976","convictionCounty":"Madison","home":"Waddy","bevinComments":"More than 40 years ago, Thomas Barker, who was a teenager at the time, made a foolish impromptu decision for which he was tried and convicted. No one was harmed, no restitution was required and since that time, Mr. Barker has lived an exemplary life. He has fully paid any debt that he may have owed to society; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Assault","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1044-264351.pdf"},{"name":"Timothy Alan Beeler","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2004","convictionCounty":"Hardin","home":"Louisville","bevinComments":"Timothy A. Beeler broke the law and was duly punished 15 years ago. Since that time he has worked to do all that has been asked of him. He has turned his life around and has paid his debt to society.","charges":"Drug and theft charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1063-264931.pdf"},{"name":"Timothy Dean Swinford","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2005","convictionCounty":"Ballard","home":"Barlow","bevinComments":"Timothy Swinford has turned his life around in recent years and has become a productive and valuable member of society.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1271-264452.pdf"},{"name":"Toderick L. Moore","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1993","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Toderick Moore is a new man. Saved  by God's grace, he has chosen  to chart a new course over the past 25 years, both inside and outside of prison. His life story and strong testimony serve as a powerful example for others seeking to break the cycle of wayward living.","charges":"Three counts of murder, plus kidnapping and robbery charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1281-264457.pdf"},{"name":"Travis Easter","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2010, 2009, 2004","convictionCounty":"Madison, Laurel","home":"Mt. Sterling","bevinComments":"Travis Easter is a new man. He has turned his life in a new an positive direction over the past decade and he is now a respected and valuable employee and citizen.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1278-264453.pdf"},{"name":"Travis Lee Brasher","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1997","convictionCounty":"Jefferson","home":"Louisville","bevinComments":"Travis Brasher was convicted of a felony more than 20 years ago and has paid his debt to society for that crime. I would encourage him to strive even more diligently to live as a fully law-abiding citizen; and I am issuing a partial pardon, not of Mr. Brashers entire criminal record, but specifically of his single felony conviction from 1997. It is my hope that he will continue to be a strong husband and father and example to others.","charges":"Robbery","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0998-264239.pdf"},{"name":"Vincent Harris Dooley","orderDate":"12/6/2019","type":"Pardon & Commutation","convictionDate":"2017","convictionCounty":"Jefferson","home":"[Blank]","bevinComments":"Based on the evidence presented and reviewed and based on the character references provided by family, friends and neighbors; and I hereby commute the sentence of Vincent H. Dooley to time served and pardon him for the felony associated with his conviction; and Mr. Dooley is being given an opportunity to chart a more constructive path in life and it is my expectation that he will seize it.","charges":"Manslaughter","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1276-264385.pdf"},{"name":"Wallace G. Cook","orderDate":"11/21/2019","type":"Pardon","convictionDate":"2006","convictionCounty":"Bracken","home":"St. Jame City, FL","bevinComments":"Wallace Cook fell asleep at the wheel and was responsible for a tragic accident that ended the lives of three innocent individuals. He has taken full responsibility for his actions and has lived an exemplary life both before and after this accident. It is not possible to restore that which has been lost, but Wallace has fully paid his debt to society in the only way allowed by law; and for this reason, it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Reckless homicide charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0909-264038.pdf"},{"name":"Wayne Price Miller","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2007, 2006","convictionCounty":"Bullitt, Jefferson ","home":"Taylorsville","bevinComments":"Wayne Miller has been a model citizen since turning his life around  more than a decade ago.","charges":"Drug charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1133-264546.pdf"},{"name":"Wesley Dale Lambdin","orderDate":"12/4/2019","type":"Pardon","convictionDate":"2006","convictionCounty":"Hopkins","home":"Madisonville","bevinComments":"Wesley Lambdin has turned his life around and has become a good husband, father, employee and citizen. He has paid his debt to society and has gotten his priorities straight in life.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1081-264948.pdf"},{"name":"William Charles Dabney III","orderDate":"12/6/2019","type":"Pardon","convictionDate":"1998","convictionCounty":"Jefferson","home":"Madison, TN","bevinComments":"William Dabney's life story is a remarkable one. From a troubled beginning, he has turned his life around and is now a model citizen.","charges":"Theft, resisting arrest and other charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1235-264418.pdf"},{"name":"William Daniel Read","orderDate":"12/4/2019","type":"Pardon ","convictionDate":"2006","convictionCounty":"Barren","home":"Glasgow","bevinComments":"William D. Read has paid his debt to society.","charges":"Manslaughter","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1092-264959.pdf"},{"name":"William Rickey Hughes","orderDate":"11/27/2019","type":"Pardon","convictionDate":"1987","convictionCounty":"Mason","home":"Slidell, LA","bevinComments":"More than 30 years ago, William R. Hughes was convicted and sentenced for a criminal act. He has paid his debt to society and has lived a model life since that time; and it is my privilege to grant Rick the full and unconditional pardon that he has requested.","charges":"Trafficking charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-0974-264173.pdf"},{"name":"William Robert Hayes","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1982","convictionCounty":"Hardin","home":"Cecilia","bevinComments":"William Hayes is a good man, a good neighbor and a good community citizen. He has lived an exemplary life for nearly 40 years since making some unwise choices as a young man. He has fully paid his debt to society and has proven himself to be an upstanding citizen; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Drug charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1017-264258.pdf"},{"name":"William Vernon Hayes","orderDate":"12/2/2019","type":"Pardon","convictionDate":"1994","convictionCounty":"Nelson","home":"Forney, TX","bevinComments":"Having reviewed the criminal history of William V. Hayes, I am not convinced he was justly treated by the criminal justice system. I am convinced, however, that he has fully paid any debt that he owes to society for any involvement he may have had in a crime that occurred 25 years ago. Since that time, Mr. Hayes has been a model citizen and a blessing to both his family and community; and it is my privilege to grant him the full and unconditional pardon that he has requested.","charges":"Burglary charge","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1016-264257.pdf"},{"name":"Willie Bazil Rollins-Slaven","orderDate":"12/6/2019","type":"Pardon","convictionDate":"2000","convictionCounty":"McCreary","home":"Parkers Lake","bevinComments":"Twenty years ago, Willie Rollins-Slaven made an unwise decision that resulted in sever criminal consequences. Since paying his debt to society, he has served his community as a volunteer and has become a solid citizen.","charges":"Arson charges","link":"http://apps.sos.ky.gov/Executive/Journal/execjournalimages/2019-MISC-2019-1267-264448.pdf"}]